# ReDrawAll

## Description
Procedure ReDrawAll invokes a full screen redraw of the active VectorWorks document. ReDrawAll is used when the document view needs to be refreshed prior to additional operation being performed in the document.

```pascal
PROCEDURE ReDrawAll;
```

```python
def vs.ReDrawAll():
    return None
```

## Examples
```pascal
ReDrawAll;
```
```python
import vs

# Procedure ReDrawAll invokes a full screen redraw of the active VectorWorks
# document.
vs.ReDrawAll()
```

## Version
Availability: from All Versions

## Category
* Utility